# Cleaning Data

In this section
* grab data from the csv that previously scrape from Seek
* clean duplicate data
* classify the location to be [ACT, NSW, NT, QLD, SA, TAS, VIC, WA]
* create a new column to specify the salary range

There are six states in Australia: New South Wales, Queensland, South Australia, Tasmania, Victoria and Western Australia.
There are two Territories

In [1]:
# import necessary packages
import time
import datetime as dt
import pandas as pd
import numpy as np

# for plotting
import matplotlib.pyplot as plt
import matplotlib.dates as mdates
from matplotlib import style
import seaborn as sns

style.use('ggplot')

%matplotlib inline

## Load data from CSV

In [2]:
# import the data from csv

In [3]:
dataAnalystLow = pd.read_csv('./datasets/dataAnalystLow.csv')
dataAnalystHigh = pd.read_csv('./datasets/dataAnalystHigh.csv')

dataEngineerLow = pd.read_csv('./datasets/dataEngineerLow.csv')
dataEngineerHigh = pd.read_csv('./datasets/dataEngineerHigh.csv')

# to be combined
dataScienceLow = pd.read_csv('./datasets/dataScienceLow.csv')
dataScienceHigh = pd.read_csv('./datasets/dataScienceHigh.csv')

dataScientistLow = pd.read_csv('./datasets/dataScientistLow.csv')
dataScientistHigh = pd.read_csv('./datasets/dataScientistHigh.csv')

#combine these 2 sets together
dataScienLow = pd.concat([dataScienceLow, dataScientistLow])
dataScienHigh = pd.concat([dataScienceHigh, dataScientistHigh])

In [4]:
dataAnalystLow.head(2)

,Unnamed: 0,title,link,salary,location,company,classification,summary
0,0,Data Migration Analyst - Legal Software,/job/37614348?type=standout,Long Term Career Opportunities,Sydney,LEAP Dev,Information & Communication Technology,The Global Transition department is responsibl...
1,1,Data Analyst,/job/37604518?type=standout,NaN,Brisbane,Paxus,Information & Communication Technology,I'm looking to speak to mid to senior level Da...

In [5]:
# all of them have ['Unnamed: 0'] columns, drop them all
dataAnalystLow.drop(columns = ['Unnamed: 0'], inplace=True)
dataAnalystHigh.drop(columns = ['Unnamed: 0'], inplace=True)


dataEngineerLow.drop(columns = ['Unnamed: 0'], inplace=True)
dataEngineerHigh.drop(columns = ['Unnamed: 0'], inplace=True)

dataScienLow.drop(columns = ['Unnamed: 0'], inplace=True)
dataScienHigh.drop(columns = ['Unnamed: 0'], inplace=True)

## Examine data for data Cleaning

In [6]:
dataScienHigh.head()

,title,link,salary,location,company,classification,summary
0,Astronomy Data Science Program Coordinator,/job/37613868?type=standout,"Salary starting from $111,602 + 17% super",Melbourne,Swinburne University of Technology,Information & Communication Technology,Swinburne is a progressive university that aim...
1,Astronomy Data Science Program Coordinator,/job/37613869?type=standout,"Salary starting from $111,602 + 17% super",Melbourne,Swinburne University of Technology,Education & Training,Swinburne is a progressive university that aim...
2,Big Data Engineer,/job/37614840?type=standard,$600 - $900 p.d.,Sydney,FIRESOFT Consulting,Information & Communication Technology,"Big Data Engineer - Surry Hills, Sydney, Austr..."
3,Data Scientist | Big data environment | Hadoop...,/job/37604293?type=standard,NaN,Sydney,Bluefin Resources Pty Limited,Science & Technology,"Our client is a national, reputable and well-k..."
4,Statistical Scientist and Data Specialist,/job/37603471?type=standout,$85953 - $118768 p.a. + 17% super,Melbourne,Deakin University,Education & Training,"JOB ID:180801SALARY RANGE: $85,953 to $118,768..."

In [7]:
# checking null colunmns - found mainly salary and a few in company.... 
# salary will be just high or low (1 or 0)
# company are not really relevant...no need cleaning
print ('Data Analyst  Low\n', dataAnalystLow.isnull().sum())
print ('------------------------------------')
print ('Data Analyst High\n', dataAnalystHigh.isnull().sum())
print ('------------------------------------')
print ('Data Engineer Low\n', dataEngineerLow.isnull().sum())
print ('------------------------------------')
print ('Data Engineer High\n', dataEngineerHigh.isnull().sum())
print ('------------------------------------')
print ('Data Science Low\n', dataScienLow.isnull().sum())
print ('------------------------------------')
print ('Data Science High\n', dataScienHigh.isnull().sum())

Data Analyst  Low
 title               0
link                0
salary            250
location            0
company             6
classification      0
summary             0
dtype: int64
------------------------------------
Data Analyst High
 title               0
link                0
salary            264
location            0
company             1
classification      0
summary             0
dtype: int64
------------------------------------
Data Engineer Low
 title               0
link                0
salary            346
location            0
company            11
classification      0
summary             0
dtype: int64
------------------------------------
Data Engineer High
 title               0
link                0
salary            250
location            0
company             6
classification      0
summary             2
dtype: int64
------------------------------------
Data Science Low
 title               0
link                0
salary            277
location            0
company            10
classification      0
summary             0
dtype: int64
------------------------------------
Data Science High
 title               0
link                0
salary            264
location            0
company             2
classification      0
summary             0
dtype: int64

In [8]:
# most of salary are empty replace salry column as high or low
dataAnalystLow['salary'] = 0
dataEngineerLow['salary'] = 0
dataScienLow['salary'] = 0

dataAnalystHigh['salary'] = 1
dataEngineerHigh['salary'] = 1
dataScienHigh['salary'] = 1

In [9]:
# knowing what the job title, let's simplify it further
# add new column with that 3 category of those 3 jobs type
dataAnalyst = pd.concat([dataAnalystLow, dataAnalystHigh])
dataEngineer = pd.concat([dataEngineerLow, dataEngineerHigh])
dataScience = pd.concat([dataScienLow, dataScienHigh])

dataAnalyst['title_cat'] = 'Data Analyst'
dataEngineer['title_cat'] = 'Data Engineer'
dataScience['title_cat'] = 'Data Scientist'

dataAnalyst['title_cat'].astype('category')
dataEngineer['title_cat'].astype('category')
dataScience['title_cat'].astype('category')

# time to combine all of them into 1 dataframe
dataDf = pd.concat([dataAnalyst, dataEngineer, dataScience])

dataDf.sample(5)

,title,link,salary,location,company,classification,summary,title_cat
181,Raw Material Analyst - Pharmaceutical,/job/37540463?type=standard,0,Melbourne,Evolve Scientific Recruitment,Science & Technology,About the company:The company is a well-known ...,Data Scientist
64,Nurse Program Coordinator - part time,/job/37602609?type=standard,0,Sydney,Ascott Sales Integration P/L,Administration & Office Support,Nurse Program Coordinator - part time Coordina...,Data Scientist
184,Reward Analyst - 3 month contract - Guaranteed...,/job/37504233?type=standout,0,Sydney,Reward Recruitment,Human Resources & Recruitment,"Reporting to a newly appointed Head of Reward,...",Data Analyst
454,Business Intelligence Lead,/job/37410972?type=standout,0,Sydney,HelloFresh,Consulting & Strategy,"About HelloFresh At HelloFresh, we want to cha...",Data Engineer
235,Production Operator,/job/37490403?type=standard,0,Brisbane,Evolve Scientific Recruitment,"Manufacturing, Transport & Logistics",Are you looking for a new challenge? Something...,Data Scientist

In [10]:
# remove unwanted columns
dataDf.drop(columns=['link', 'company'], inplace=True)

In [11]:
# No of locations
print ('No of unique locations ', dataDf.location.nunique())
print ('No of unique classifications ', dataDf.classification.nunique())

No of unique locations  47
No of unique classifications  28

Data cleaning to do

1. Summary - Some advertisement posted multiple times - need to drop duplicates
2. Location are not based on States or Territories, need to convert them

###  Data Manipulation - Drop Duplicates
    1. Drop duplicates based on summary

In [12]:
dataDf.shape

(2615, 6)

In [13]:
# shows number of duplicates
dataDf[dataDf.duplicated(['summary'], keep='first')].shape

(1219, 6)

In [14]:
# drop all duplicates except first one and show shapes
dataDf.drop_duplicates(subset=['summary'], inplace=True)
dataDf.shape

(1396, 6)

###  Data Manipulation and Cleaning
    2. Modify the locations to make it into the correct States and Territories
    
    Steps
    * 63 different locations
    * Create function to convert
    * Apply it to dataDF and Save it to new Columns
    # Remove all those that are overseas ads

In [15]:
# find unique locations, classified them in to the correct States
location_list = dataDf.location.unique()
location_list

array(['Sydney', 'Brisbane', 'Melbourne', 'Adelaide', 'Perth',
       'South West Coast VIC', 'ACT', 'Gold Coast', 'Cairns & Far North',
       'Blue Mountains & Central West', 'Sunshine Coast',
       'Newcastle, Maitland & Hunter',
       'Wollongong, Illawarra & South Coast',
       'Coffs Harbour & North Coast', 'Katherine & Northern Australia',
       'Gosford & Central Coast', 'Gladstone & Central QLD', 'Darwin',
       'Mackay & Coalfields', 'Port Macquarie & Mid North Coast',
       'Toowoomba & Darling Downs', 'Horsham & Grampians', 'Northern QLD',
       'Wagga Wagga & Riverina', 'Dubbo & Central NSW',
       'Lismore & Far North Coast', 'Bairnsdale & Gippsland',
       'Albany & Great Southern', 'Tamworth & North West NSW',
       'Launceston & North East', 'Bunbury & South West',
       'Port Hedland, Karratha & Pilbara',
       'Yorke Peninsula & Clare Valley', 'Hobart',
       'Ballarat & Central Highlands', 'Western QLD', 'Mandurah & Peel',
       'Whyalla & Eyre Peninsula', 'Mornington Peninsula & Bass Coast',
       'West Gippsland & Latrobe Valley', 'Broome & Kimberley',
       'Bendigo, Goldfields & Macedon Ranges',
       'Fleurieu Peninsula & Kangaroo Island', 'Mildura & Murray',
       'Alice Springs & Central Australia', 'Riverland & Murray Mallee',
       'Somerset & Lockyer'], dtype=object)

In [16]:
ACT = ['ACT']

NSW =['NSW', 'Sydney', 'Albury Area', 'Blue Mountains & Central West', 'Coffs Harbour & North Coast', 
      'Gosford & Central Coast', 'Lismore & Far North Coast', 'Newcastle, Maitland & Hunter',
       'Port Macquarie & Mid North Coast', 'Richmond & Hawkesbury', 'Southern Highlands & Tablelands',
       'Tumut, Snowy & Monaro', 'Wagga Wagga & Riverina','Wollongong, Illawarra & South Coast']

NT = ['NT', 'Darwin', 'Alice Springs & Central Australia']

QLD = ['QLD', 'Brisbane', 'Bundaberg & Wide Bay Burnett', 'Cairns & Far North', 'Gold Coast', 
       'Hervey Bay & Fraser Coast', 'Katherine & Northern Australia', 'Mackay & Coalfields', 
       'Rockhampton & Capricorn Coast', 'Somerset & Lockyer', 'Sunshine Coast', 'Toowoomba & Darling Downs']

SA = ['SA', 'Adelaide', 'Adelaide Hills & Barossa', 'Fleurieu Peninsula & Kangaroo Island',
      'Mt Gambier & Limestone Coast', 'Riverland & Murray Mallee', 
      'Whyalla & Eyre Peninsula', 'Yorke Peninsula & Clare Valley']

TAS = ['TAS', 'Hobart', 'Devonport & North West', 'Launceston & North East']

VIC = ['VIC', 'Melbourne', 'Bairnsdale & Gippsland', 'Ballarat & Central Highlands',
       'Bendigo, Goldfields & Macedon Ranges', 'Horsham & Grampians','Mornington Peninsula & Bass Coast',
       'Shepparton & Goulburn Valley', 'West Gippsland & Latrobe Valley', 'Yarra Valley & High Country']

WA = ['WA', 'Perth', 'Albany & Great Southern', 'Bairnsdale & Gippsland', 'Bendigo, Goldfields & Macedon Ranges', 
      'Broome & Kimberley', 'Bunbury & South West', 'Kalgoorlie, Goldfields & Esperance','Geraldton, Gascoyne & Midwest', 
      'Mandurah & Peel', 'Mildura & Murray', 'Northam & Wheatbelt', 'Port Hedland, Karratha & Pilbara']

In [17]:
def get_location_states(location):
    
    if len(location) <= 3:
        #Already in the correct States or Territories
        return location
    
    #check if the data has the states inside, get the last 3 letters and remove space
    loc = location[-3:].strip()
    
    if loc.isupper():
        # return the states if all 3 or 2 letters are upper case
        return loc
    
    if location in NSW:
        return 'NSW'
    
    if location in VIC:
        return 'VIC'
    
    if location in QLD:
        return 'QLD'
    
    if location in WA:
        return 'WA'
    
    if location in SA:
        return 'SA'
    
    if location in TAS:
        return 'TAS'
    
    if location in NT:
        return 'NT'
 
    print (location)
    return 'NA'

In [18]:
dataDf['state'] = dataDf['location'].apply(get_location_states)
print(dataDf['state'].unique())
dataDf.sample()

['NSW' 'QLD' 'VIC' 'SA' 'WA' 'ACT' 'NT' 'TAS']

,title,salary,location,classification,summary,title_cat,state
75,Junior/ Graduate Business Analyst,0,Melbourne,Information & Communication Technology,"About Us Make It Mine, is an Australian consum...",Data Analyst,VIC

In [19]:
# check if found any state that is NA (overseas listing)
# none are found
dataDf[dataDf['state'] == 'NA'].sum()

title             0.0
salary            0.0
location          0.0
classification    0.0
summary           0.0
title_cat         0.0
state             0.0
dtype: float64

In [20]:
# There are still probably that some companies are duplicates with each other when combined all groups togther
# This will be dealt with later

### Drop all the columns that no longer in our interest

In [21]:
dataDf.head()

,title,salary,location,classification,summary,title_cat,state
0,Data Migration Analyst - Legal Software,0,Sydney,Information & Communication Technology,The Global Transition department is responsibl...,Data Analyst,NSW
1,Data Analyst,0,Brisbane,Information & Communication Technology,I'm looking to speak to mid to senior level Da...,Data Analyst,QLD
2,SAP Master Data Analyst,0,Sydney,Information & Communication Technology,One of our leading client’s is looking to hire...,Data Analyst,NSW
3,Data Analyst,0,Sydney,Consulting & Strategy,Energy Action is a leading national provider o...,Data Analyst,NSW
4,"Data Officer, Senior Data Analyst",0,Melbourne,Government & Defence,We are the Australian Institute of Family Stud...,Data Analyst,VIC

In [22]:
dataDf.drop(columns=['location'], inplace=True)

In [23]:
dataDf.shape

(1396, 6)

In [24]:
# Extract if there is a Junior or Senior in Job Title
# Assign 1 to senior

In [25]:
def position_level(job_title):
    
    ### junior = 0, others = -1, seniors = 1
    
    job_title = job_title.lower()
    
    if 'senior' in job_title:
        return 1
    
    if 'manager' in job_title:
        return 1
    
    if 'director' in job_title:
        return 1
    
    
    if 'junior' in job_title:
        return 0
    
    if 'graduate' in job_title:
        return 0
    
    return -1

In [26]:
dataDf['position_lvl'] = dataDf['title'].map(position_level)

In [27]:
dataDf.sample(10)

,title,salary,classification,summary,title_cat,state,position_lvl
176,"Manager, Client Services",1,Education & Training,About Griffith University At Griffith Universi...,Data Scientist,QLD,1
163,Technical Architect,1,Information & Communication Technology,Do you believe you can do anything? Then we’re...,Data Scientist,WA,-1
386,P/T BI BA,0,Information & Communication Technology,Our client is a NSW Government organisation wi...,Data Analyst,NSW,-1
344,Campaign Analyst | Marketing & Campaign Analyt...,1,Consulting & Strategy,A major Australian Brand is looking for three ...,Data Analyst,NSW,-1
229,"Associate Research Fellow, Thermoplastic Compo...",0,Education & Training,"JOB ID: 180781SALARY RANGE: $67,562 to $90,827...",Data Engineer,VIC,-1
73,Technical Business Analyst | Performance & Dat...,1,Information & Communication Technology,Technical Business Analyst 3-Month Contract P...,Data Analyst,QLD,-1
36,Data Scientist,1,Science & Technology,About the business and the role My client is ...,Data Scientist,NSW,-1
228,Trust Accounting and Reporting Analyst,0,Accounting,About ME We’re not like other banks. ME was cr...,Data Analyst,VIC,-1
117,Clinical Trials Regulatory Specialist,0,Education & Training,"Sunshine Coast Full-time, fixed-term positio...",Data Scientist,QLD,-1
368,MS BI Analyst Programmer - contract position,1,Information & Communication Technology,Large scale QLD government department looking...,Data Analyst,QLD,-1

In [28]:
dataDf.to_csv('./datasets/salary.csv')